Project/Toir.Adaptation/src/Documents/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОстановочныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="257e119a-9702-494e-9a0d-30d09f28a8d8">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d3e6539a-bc41-4756-af40-0ec93e945573">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="870a0ec8-cc69-4640-831b-040d17577206">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aadecd36-3263-4a05-82c6-367df7cb43ff">
    <name>КорректируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c09294c-0c23-45f9-a35e-88165a20ad3c">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8bee59e6-9375-41d1-8b10-74e8a2f72adb">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="733f0db0-2fd1-44e3-9d56-c2c441946753">
    <name>ДатаОкончанияРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b9f9f6a4-e812-433e-86e6-abad1b3682ce">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0769d0a1-3906-41f6-9f6a-7e8b8df1b7c8">
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5224d15e-9865-4966-bcf6-196967583a30">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0dec37ac-60d3-4abd-a934-dca9a3f9f7e0">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="742ccae6-b860-43fe-b068-f9deadfccdf6">
    <name>IDОсновногоРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="32445dcf-d18c-4012-a6a5-f679ea0c184d">
    <name>СвязанныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="96a3d540-218a-4e7b-acca-e0ab315b0f27">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9a3fe1b3-8f5b-4a1b-a245-dd09fb68e8da">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a165e2a-d88e-4bd9-83eb-d402a4f8539a">
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5fcf3c88-d726-4301-9701-de10827cd94c">
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4f53cb48-fad0-4f17-b5d2-ee52667fa7c4">
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="05a6a1f9-7146-41da-bde8-ff00adf6e3c7">
      <name>ДатаНачалаРемонтаСтарая</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="57f50cb1-fc6c-4a17-ae31-ee9d83258545">
      <name>ДатаОкончанияРемонтаСтарая</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0e1e9c25-5335-4b4a-b58e-c7f01a4bfdc2">
      <name>Отвязать</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5db69a36-d626-48ec-bada-ea0363653ec1">
      <name>ДокументИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0341bad4-58d3-449c-a2f4-2783d9f5d1cb">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cc992b0e-62a1-463f-96f0-3c359ea348a2">
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d69350b-d5a7-4fac-8436-f1b14da15cab">
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеЗаявки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="63eb186f-3d50-43ff-911a-18c004e7d600">
    <name>ИДРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b7320fcb-d548-4601-9a7c-f8afd914b08c">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОстановочныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отвязан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>IDЗависимого</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>IDОсновного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыСтроительства</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Хозспособ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Подрядный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ОстановочныеРемонты/ObjectModule.bsl
#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура гкс_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Отказ = Ложь;
	торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения, Отказ, Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(ДанныеЗаполнения, ЭтотОбъект);	

	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда

			ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка;
			КорректируемыйДокумент = ДанныеЗаполнения;
			ДокументОснование = ДанныеЗаполнения.ДокументОснование;
			IDОсновногоРемонта = ДанныеЗаполнения.IDОсновногоРемонта;
			ОбъектРемонта = ДанныеЗаполнения.ОбъектРемонта;
			ВидРемонта = ДанныеЗаполнения.ВидРемонта;
			ДатаНачалаРемонта = ДанныеЗаполнения.ДатаНачалаРемонта;
			ДатаОкончанияРемонта = ДанныеЗаполнения.ДатаОкончанияРемонта;
			ДатаНачалаРемонтаСт = ДанныеЗаполнения.ДатаНачалаРемонта;
			ДатаОкончанияРемонтаСт = ДанныеЗаполнения.ДатаОкончанияРемонта;
			#Вставка
			гкс_Сводный = ДанныеЗаполнения.гкс_Сводный;
			#КонецВставки

			Для Каждого Строка Из ДанныеЗаполнения.СвязанныеРемонты Цикл
				Если Не Строка.Отвязать Тогда
					НС = СвязанныеРемонты.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Строка, ,"ДатаНачалаРемонтаСтарая, ДатаОкончанияРемонтаСтарая");
					НС.ДатаНачалаРемонтаСтарая = Строка.ДатаНачалаРемонта;
					НС.ДатаОкончанияРемонтаСтарая = Строка.ДатаОкончанияРемонта;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.ОстановочныйРемонт;
			ДокументОснование = ДанныеЗаполнения;

			ИмяТЧ = торо_Ремонты.ПолучитьИмяТЧРемонтов(ДанныеЗаполнения);
			Неотмененный = торо_ЗаполнениеДокументов.ВернутьIDНеотмененногоРемонтаВРегламентныхМероприятиях(ДанныеЗаполнения, ДанныеЗаполнения[ИмяТЧ]);

			Если ИмяТЧ <> Неопределено И Неотмененный <> ""  Тогда

				СоответствиеИДДокументам = Новый Соответствие;
				СоответствиеИДДокументам.Вставить(Неотмененный, ДанныеЗаполнения);   
				торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(СоответствиеИДДокументам, ЭтотОбъект);

			КонецЕсли;			
			#Вставка
	Запрос = Новый Запрос();
	#Область Запрос
	Запрос.Текст = "
		|ВЫБРАТЬ
	|	ВсеРемонты.ID КАК ID,
	|	ВсеРемонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВсеРемонты.ВидРемонтныхРабот КАК ВидРемонта,
	|	ВсеРемонты.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокБезОтмененных
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования  КАК ВсеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО ВсеРемонты.Ссылка = торо_ОтмененныеЗаявки.Заявка
	|			И ВсеРемонты.ID = торо_ОтмененныеЗаявки.ИДРемонта
	|ГДЕ
	|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|	И ВсеРемонты.Ссылка В (&Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|
	|;
	|выбрать
	|ДокТЧ.Исполнитель КАК Исполнитель,
	|ДокТЧ.НомерСтроки КАК НомерСтроки,
	|ТЧ.ID КАК ИД,
	|ТЧ.Регистратор КАК Регистратор
	|Поместить ВсеИсполнители
	|ИЗ РемонтыЗаявокБезОтмененных КАК ТЧ
	|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ДокТЧ
	|	ПО ДокТЧ.Ссылка = ТЧ.Регистратор И ДокТЧ.РемонтыОборудования_ID = ТЧ.ID
	|;
	|//////////////////
	|выбрать
	|ТЧ.ИД КАК ИД,
	|ТЧ.Регистратор КАК Регистратор,
	|Минимум(ТЧ.НомерСтроки) КАК НомерСтроки
	|Поместить ПервыеСтрокиИсполнителей
	|ИЗ ВсеИсполнители КАК ТЧ
	|Сгруппировать по
	|ТЧ.ИД,
	|ТЧ.Регистратор
	|;
	|/////////////////////
	|выбрать
	|ТЧ.ИД КАК ИД,
	|ТЧ.Регистратор КАК Регистратор,
	|ТЧ.Исполнитель КАК Исполнитель
	|Поместить ТЧ_Исполнители
	|ИЗ ВсеИсполнители КАК ТЧ
	|	внутреннее соединение ПервыеСтрокиИсполнителей КАК ТЧ2
	|	ПО ТЧ.ИД = ТЧ2.ИД И ТЧ.НомерСтроки = ТЧ2.НомерСтроки И ТЧ.Регистратор = ТЧ2.Регистратор
	|;
	|УНИЧТОЖИТЬ ВсеИсполнители;
	|УНИЧТОЖИТЬ ПервыеСтрокиИсполнителей;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	РемонтыЗаявокБезОтмененных.ID КАК ID,
	|	РемонтыЗаявокБезОтмененных.ОбъектРемонта КАК ОбъектРемонтныхРабот,
	|	РемонтыЗаявокБезОтмененных.ВидРемонта КАК ВидРемонтныхРабот,
	|	РемонтыЗаявокБезОтмененных.Регистратор КАК Регистратор,
	|	Выбор когда не ТЧ.Исполнитель есть NULL И ТЧ.Исполнитель Ссылка Справочник.Контрагенты
	|	Тогда Значение(Перечисление.СпособыСтроительства.Подрядный)
	|	Иначе Значение(Перечисление.СпособыСтроительства.ХозСпособ) Конец КАК СпособВыполнения,
	|	ТЧ.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВсеРемонтыПоУсловиям
	|ИЗ
	|	РемонтыЗаявокБезОтмененных КАК РемонтыЗаявокБезОтмененных
	|	Левое соединение ТЧ_Исполнители КАК ТЧ
	|	ПО ТЧ.ИД = РемонтыЗаявокБезОтмененных.ID И РемонтыЗаявокБезОтмененных.Регистратор = ТЧ.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВсеОтмененныеИЗавершенные
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВсеРемонтыПоУсловиям.ID КАК ID
	|				ИЗ
	|					ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОтмененныеРемонтыСрезПоследних.ID
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВсеРемонтыПоУсловиям.ID КАК ID
	|				ИЗ
	|					ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям)) КАК торо_ОтмененныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОтмененныеРемонтыСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРемонтыПоУсловиям.ID КАК ID,
	|	ВсеРемонтыПоУсловиям.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВсеРемонтыПоУсловиям.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВсеРемонтыПоУсловиям.Регистратор КАК Регистратор,
	|	ВсеРемонтыПоУсловиям.СпособВыполнения КАК СпособВыполнения,
	|	ВсеРемонтыПоУсловиям.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВсеНезавершенные
	|ИЗ
	|	ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОтмененныеИЗавершенные КАК ВсеОтмененныеИЗавершенные
	|		ПО ВсеРемонтыПоУсловиям.ID = ВсеОтмененныеИЗавершенные.ID
	|ГДЕ
	|	ВсеОтмененныеИЗавершенные.ID ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного КАК IDОсновного,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDЗависимого
	|ПОМЕСТИТЬ ВсеВключенныеВОстановочные
	|ИЗ
	|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
	|			,
	|			(IDЗависимого В
	|					(ВЫБРАТЬ
	|						ВсеНезавершенные.ID КАК ID
	|					ИЗ
	|						ВсеНезавершенные КАК ВсеНезавершенные)
	|				)
	|				И НЕ Регистратор В (&Ссылка)) КАК торо_ОстановочныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDОсновного,
	|	IDЗависимого
	|;

			|ВЫБРАТЬ
	|	ВсеНезавершенные.ID КАК ID,
	|	ВсеНезавершенные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВсеНезавершенные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияРемонтныхРабот,
	|	ВсеНезавершенные.Регистратор КАК Регистратор,
	|	ВсеНезавершенные.СпособВыполнения КАК СпособВыполнения,
	|	ВсеНезавершенные.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|ИЗ
	|	ВсеНезавершенные КАК ВсеНезавершенные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеВключенныеВОстановочные КАК ВсеВключенныеВОстановочные
	|		ПО ВсеНезавершенные.ID = ВсеВключенныеВОстановочные.IDОсновного
	|			И ВсеНезавершенные.ID = ВсеВключенныеВОстановочные.IDЗависимого
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВсеНезавершенные.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	ВсеВключенныеВОстановочные.IDОсновного ЕСТЬ NULL
	|	И ВсеВключенныеВОстановочные.IDЗависимого ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
	|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта
	|ПОМЕСТИТЬ ВТ_Критичности
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
	|				ИЗ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)) КАК торо_ВыявленныеДефектыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыОборудования.ID КАК ID,
	|	РемонтыОборудования.КритичностьДефекта КАК КритичностьДефекта,
	|	РемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
	|	РемонтыОборудования.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Критичности2
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыОборудования
	|Где РемонтыОборудования.Ссылка.Проведен 
	|	И РемонтыОборудования.ID В
	|				(ВЫБРАТЬ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
	|				ИЗ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|Выбрать
	|ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК Регистратор,
	|торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
	|Поместить ВТ_Статусы
	|Из ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|		ПО торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ВидРемонтныхРабот КАК ВидРемонта,
	|	ДобавитьКДате(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаНачалаРемонтныхРабот, Час, &Сдвиг) КАК ДатаНачалаРемонта,
	|	ДобавитьКДате(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаОкончанияРемонтныхРабот, Час, &Сдвиг) КАК ДатаОкончанияРемонта,
	|	ДобавитьКДате(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаНачалаРемонтныхРабот, Час, &Сдвиг) КАК ДатаНачалаРемонтаСтарая,
	|	ДобавитьКДате(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаОкончанияРемонтныхРабот, Час, &Сдвиг) КАК ДатаОкончанияРемонтаСтарая,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК ДокументИсточник,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.СпособВыполнения КАК СпособВыполнения,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Исполнитель КАК Исполнитель,
	|	Ложь КАК Зависимый,
	|	Ложь КАК Подчиненный,
	|	Истина КАК О,
	|	ЕСТЬNULL(ВТ_Критичности2.КритичностьДефекта,
	|		ЕСТЬNULL(ВТ_Критичности.КритичностьДефекта, 
	|			ЗНАЧЕНИЕ(Справочник.торо_КритичностьДефекта.ПустаяСсылка))) КАК КритичностьДефекта,
	|	ВТ_Критичности2.ОписаниеРемонта КАК гкс_ОписаниеРемонта,
	|	ВТ_Статусы.Статус КАК гкс_Статус
	|ИЗ
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности КАК ВТ_Критичности
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности2 КАК ВТ_Критичности2
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности2.ID
	|		И ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор = ВТ_Критичности2.Ссылка
	|		Внутреннее соединение ВТ_Статусы КАК ВТ_Статусы
	|		ПО ВТ_Статусы.Регистратор = ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор
	|
	|";
	#КонецОбласти
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	Запрос.УстановитьПараметр("Сдвиг", Сдвиг);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СвязанныеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
			#КонецВставки

		КонецЕсли;
	Иначе
		ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.ОстановочныйРемонт;
	КонецЕсли;


КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура гкс_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВидОперации <> Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КорректируемыйДокумент");
	КонецЕсли;

	Если ДатаНачалаРемонта > ДатаОкончанияРемонта Тогда
		ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación de parada es más grande que la fecha de la terminación!';ru='Дата начала остановочного ремонта больше даты окончания!';en='The start date of the overhaul is longer than the end date!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;

	// Проверим чтобы ни один ремонт в таблице зависимых не выходил за пределы даты начала и окончания основного.
	Для Каждого Зависимый Из СвязанныеРемонты Цикл

		Если НЕ ЗначениеЗаполнено(Зависимый.ДатаНачалаРемонта) ИЛИ НЕ ЗначениеЗаполнено(Зависимый.ДатаОкончанияРемонта) Тогда
			Продолжить;
		КонецЕсли;

		Если Зависимый.ДатаНачалаРемонта > Зависимый.ДатаОкончанияРемонта Тогда
			ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación es más grande que la fecha de la terminación!';ru='Дата начала ремонта больше даты окончания!';en='Repair start date is greater than the end date!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;

		#Удаление
		Если Не Зависимый.Отвязать Тогда
		#КонецУдаления
		#Вставка
		Если Не Зависимый.Отвязать И гкс_Сводный Тогда
		#КонецВставки
			Если Зависимый.ДатаНачалаРемонта < ДатаНачалаРемонта Или Зависимый.ДатаНачалаРемонта > ДатаОкончанияРемонта Тогда
				ШаблонСообщения = НСтр("es='¡La fecha del comienzo de la reparación dependiente en la línea № %1 pasa de la raya del período de la reparación básica!';ru='Дата начала зависимого ремонта в строке №%1 выходит за пределы периода основного ремонта!';en='The start date of the dependent repair in line No.%1 goes beyond the period of the main repair!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Зависимый.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;

			Если Зависимый.ДатаОкончанияРемонта < ДатаНачалаРемонта Или Зависимый.ДатаОкончанияРемонта > ДатаОкончанияРемонта Тогда
				ШаблонСообщения = НСтр("es='¡La fecha de la terminación de la reparación dependiente en la línea № %1 pasa de la raya del período de la reparación básica!';ru='Дата окончания зависимого ремонта в строке №%1  выходит за пределы периода основного ремонта!';en='The dependent repair end date in line №%1 is outside the main repair period!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Зависимый.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	#Вставка
	МассивНепроверяемыхРеквизитов.Добавить("ДокументОснование");
	МассивНепроверяемыхРеквизитов.Добавить("IDОсновногоРемонта");
	#КонецВставки
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)

	ШаблонСообщения = НСтр("es='Hay un documento no pasado la razón: %1';ru='Есть непроведенный документ основание: %1';en='There is an unsent document basis:%1'");

	Для Каждого СвязанныйРемонт Из СвязанныеРемонты Цикл
		Если Не СвязанныйРемонт.ДокументИсточник.Проведен Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(СвязанныйРемонт.ДокументИсточник));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;	

	#Удаление
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Проведен") Тогда
	#КонецУдаления
	#Вставка
	Если гкс_Сводный = Ложь И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Проведен") Тогда
	#КонецВставки
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ДокументОснование));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;

	Если ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка Тогда
		Если Не КорректируемыйДокумент.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Есть непроведенный документ основание: " + КорректируемыйДокумент + "'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;

		Если Дата <= КорректируемыйДокумент.Дата Тогда
			ТекстСообщения = НСтр("es='¡La fecha de la corrección debe ser más de fechas corregido!';ru='Дата корректировки должна быть больше даты корректируемого!';en='The date of adjustment must be greater than the date of the adjusted!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;

	ШаблонСообщения = НСтр("es='La fecha del documento debe ser más de fechas del documento-fuente: ¡%1!';ru='Дата документа должна быть больше даты документа-источника: %1!';en='The document date must be greater than the date of the source document:%1!'");

	Для Каждого СвязанныйРемонт Из СвязанныеРемонты Цикл
		Если СвязанныйРемонт.ДокументИсточник.Дата >= Дата Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(СвязанныйРемонт.ДокументИсточник));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;	

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// гкс+ [разработка 2021] Куст 
&ИзменениеИКонтроль("ПроверитьСуществованиеСледующихДокументов")
Процедура гкс_ПроверитьСуществованиеСледующихДокументов(Отказ)
	#Вставка
	Возврат;
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.ID КАК ИД
	|ПОМЕСТИТЬ ИДДокумента
	|ИЗ
	|	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
	|ГДЕ
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	торо_Ремонты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	торо_Ремонты.ID В
	|			(ВЫБРАТЬ
	|				Таб.ИД
	|			ИЗ
	|				ИДДокумента КАК Таб)
	|	И торо_Ремонты.Период >= &ДатаДок
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_Ремонты.Период";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Дата);

	резЗапроса = Запрос.Выполнить();

	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	Выборка = резЗапроса.Выбрать();
	Выборка.Следующий();
	ШаблонСообщения = НСтр("es='¡Los datos de estas reparaciones son cambiados ya en el documento %1.!';ru='Данные этих ремонтов уже изменены в документе %1.!';en='The repair data has already been changed in document%1.!'");
	ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Регистратор);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);

КонецПроцедуры // гкс- [разработка 2021] 

&ИзменениеИКонтроль("ДвиженияПоРегистру_торо_ОстановочныеРемонты")
Процедура гкс_ДвиженияПоРегистру_торо_ОстановочныеРемонты(Отказ, ТабРемонтовСОсновным)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеРемонты.ID,
	|	СвязанныеРемонты.Отвязать,
	|	СвязанныеРемонты.ДатаНачалаРемонта,
	|  СвязанныеРемонты.ДатаОкончанияРемонта
	|ПОМЕСТИТЬ СвязанныеРемонты
	|ИЗ
	|	&СвязанныеРемонты КАК СвязанныеРемонты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДоступность.ID,
	|	ТабДоступность.ДоступенДляРедактирования
	|ПОМЕСТИТЬ ТабДоступность
	|ИЗ
	|	&ТабДоступность КАК ТабДоступность
	|;
	|
	#Вставка
	|";
	Если гкс_Сводный Тогда
		Запрос.Текст = Запрос.Текст + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОстановочныеРемонты.ID КАК IDОсновного,
		|	торо_ОстановочныеРемонты.ID КАК IDЗависимого, 
		|	торо_ОстановочныеРемонты.Отвязать КАК Отвязан,
		|	торо_ОстановочныеРемонты.ДатаНачалаРемонта,
		|  торо_ОстановочныеРемонты.ДатаОкончанияРемонта
		|ИЗ
		|	СвязанныеРемонты КАК торо_ОстановочныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДоступность КАК ТабДоступность
		|		ПО торо_ОстановочныеРемонты.ID = ТабДоступность.ID
		|ГДЕ
		|	ТабДоступность.ДоступенДляРедактирования";
	Иначе
	Запрос.Текст = Запрос.Текст + "
	#КонецВставки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&IDОсновного КАК IDОсновного,
	|	торо_ОстановочныеРемонты.ID КАК IDЗависимого, 
	|	торо_ОстановочныеРемонты.Отвязать КАК Отвязан,
	|	торо_ОстановочныеРемонты.ДатаНачалаРемонта,
	|  торо_ОстановочныеРемонты.ДатаОкончанияРемонта
	|ИЗ
	|	СвязанныеРемонты КАК торо_ОстановочныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДоступность КАК ТабДоступность
	|		ПО торо_ОстановочныеРемонты.ID = ТабДоступность.ID
	|ГДЕ
	|	ТабДоступность.ДоступенДляРедактирования";
	#Вставка
	КонецЕсли;
	#конецВставки

	Запрос.УстановитьПараметр("СвязанныеРемонты", ТабРемонтовСОсновным);
	Запрос.УстановитьПараметр("IDОсновного",IDОсновногоРемонта);
	Запрос.УстановитьПараметр("ТабДоступность", Документы.торо_ОстановочныеРемонты.ОбновитьДоступностьДляРедактирования(Ссылка,ТабРемонтовСОсновным));

	ПланРемонтовДвижения = Запрос.Выполнить().Выгрузить();

	НаборЗаписей = РегистрыСведений.торо_ОстановочныеРемонты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	СтарыеДвижения = НаборЗаписей.Выгрузить();

	Движения.торо_ОстановочныеРемонты.Очистить();
	Движения.торо_ОстановочныеРемонты.Записывать = Истина;

	Если Не Отказ Тогда

		Для Каждого ИсходнаяСтрока Из СтарыеДвижения Цикл
			СтрДостДляРед = ПланРемонтовДвижения.НайтиСтроки(Новый Структура("IDЗависимого", ИсходнаяСтрока.IDЗависимого));
			СтрЕстьВДок = ТабРемонтовСОсновным.НайтиСтроки(Новый Структура("ID", ИсходнаяСтрока.IDЗависимого));
			Если СтрДостДляРед.Количество() = 0 И СтрЕстьВДок.Количество() > 0 Тогда
				Движение = Движения.торо_ОстановочныеРемонты.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ИсходнаяСтрока);
			КонецЕсли;
		КонецЦикла;

		Для каждого ИсходнаяСтрока Из ПланРемонтовДвижения Цикл
			Движение = Движения.торо_ОстановочныеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ИсходнаяСтрока);
			Движение.Период = Дата;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьТаблицуРемонтовСОсновным")
Функция гкс_ПолучитьТаблицуРемонтовСОсновным()

	ТаблицаРемонтовСОсновным = СвязанныеРемонты.Выгрузить();
	#Вставка
	Если гкс_Сводный Тогда 
		Возврат ТаблицаРемонтовСОсновным;
	КонецЕсли;
	#КонецВставки
	НС = ТаблицаРемонтовСОсновным.Добавить();
	НС.ID = IDОсновногоРемонта;
	НС.ОбъектРемонта = ОбъектРемонта;
	НС.ВидРемонта = ВидРемонта;
	НС.ДатаНачалаРемонта = ДатаНачалаРемонта;
	НС.ДатаОкончанияРемонта = ДатаОкончанияРемонта;
	НС.ДатаНачалаРемонтаСтарая = ДатаНачалаРемонтаСт;
	НС.ДатаОкончанияРемонтаСтарая = ДатаОкончанияРемонтаСт;
	НС.ДокументИсточник = ДокументОснование;

	Возврат ТаблицаРемонтовСОсновным;

КонецФункции

#КонецОбласти
